PIM_III/02_Modelagem_UML_Astah/UC07_Escalar_Duvida_Tutor/README.md
```mermaid
sequenceDiagram
    autonumber
    participant IA as :AgenteIA
    participant T as :MD_Tutor
    participant Al as :Aluno
    IA->>IA: detectarComplexidade()
    IA->>T: escalar(duvida, id)
    T-->>Al: Resposta
```
