PIM_III/02_Modelagem_UML_Astah/UC07_Escalar_Duvida_Tutor/UC07_Sequencia.puml
@startuml
skinparam monochrome true
autonumber
participant IA as ":AgenteIA"
participant T as ":Tutor"
participant Al as ":Aluno"
IA -> IA : detectarComplexidade()
IA -> T : escalar(duvida, id)
T --/ Al : Resposta
@enduml
